from django.core.management.base import BaseCommand
from django.contrib.auth.models import User
from django.utils import timezone  # Import Django's timezone utilities
from products.models import Product, ProductComment  # Update with your actual models
import random

class Command(BaseCommand):
    help = 'Create 5 comments for each product and associate them with products'

    def handle(self, *args, **kwargs):
        try:
            products = Product.objects.all()
            total_products = products.count()

            if total_products == 0:
                self.stdout.write(self.style.WARNING('No products found. Aborting comment creation.'))
                return

            comment_bodies = [
                "خیلی زود به دستم رسید ممنونم",
                "من خیلی راضی بودم واقعا با کیفیت بود",
                "خوب بود به نظرم ",
                "عالی بود مرسی ",
                "دم شما گرم عالی بود",
                "محصول خوبی بود ارسال هم سریع بود ",
                "با تشکر و آروز موفقیت",
                "از خدمات دقیق، سریع، مودبانه و حرفه ای شما نهایت احترام و تشکر را داریم",
                "با سلام، بابت سطح بالایی از توجه به جزئیات و مسئولیت پذیری که در هر پروژه فروش نشان دادید مچکرم",
                "قدردان زحمات شما هستیم",
                "ممنون از زحمات شما، سپاس گذارم",
                "بابت زحماتتون و کیفیت فوق‌العاده محصول متشکرم",
                "واقعاً از خریدم راضی‌ام، ممنون از تیم حرفه‌ای‌تا",
                "تحویل به موقع و کیفیت بسته‌بندی عالی بود، سپاس",
                "محصول دقیقاً همان چیزی بود که می‌خواستم، متشکرم",
                "از اینکه به مشتریانتون اهمیت می‌دهید، سپاسگزارم",
                "خدمات مشتری فوق‌العاده‌ای داشتید، بابت همه چیز متشکرم",
                "کیفیت محصول شما واقعاً تحسین‌برانگیزه، سپاس",
                "بابت پاسخگویی سریعتون و کمکتون ممنونم",
                "فروشگاه بسیار خوش برخورد و محترمی هستید، متشکرم",
                "بسته‌بندی بی نقص و زیبا بود، ممنون از شما",
                "خدمات پس از فروش شما واقعاً عالی بود، متشکرم",
                "بابت ارائه محصولات باکیفیت، واقعا سپاسگزارم",
                "تجربه خریدی بی‌نظیر داشتم، ممنون از شما",
                "به خاطر ارسال سریع و بی‌دردسر، سپاس",
                "خریدی رضایت‌بخش داشتم، ممنون از خدمات عالی‌تون",
                "به خاطر پشتیبانی و مشاوره‌تون متشکرم",
                "توضیحات دقیق و کامل محصول بسیار کمک‌کننده بود، سپاس",
                "محصول با ارزشی بود، ممنون از قیمت منصفانه‌تون",
                "از صبر و پشتیبانی شما در فرآیند خرید متشکرم",
                "فروشنده‌ای قابل اعتماد و حرفه‌ای هستید، سپاس",
                "راهنمایی‌های شما در انتخاب محصول بسیار مفید بود، متشکرم",
                "از تخفیف‌ها و پیشنهادات ویژه‌تون ممنونم",
                "بابت محصول اورجینال و باکیفیت، سپاسگزارم",
                "همیشه از خرید از شما لذت می‌برم، ممنون",
                "محصول عالی و خدمات بی‌نظیری ارائه دادید، سپاس",
                "ارسال بسته با احتیاط و دقت تحسین‌برانگیز بود، ممنون",
                "تجربه‌ای فوق‌العاده از خرید آنلاین داشتم، سپاس",
                "بابت محصولی که بیش از انتظارم بود، متشکرم",
                "رضایت کامل دارم، به دوستونم هم شما را پیشنهاد می‌کنم",
                "کیفیت، قیمت و خدمات شما بی‌نظیره، ممنون",
                "خسته نباشید، تجربه‌ای عالی و رضایت‌بخش از خرید داشتم، مچکر",
                "از اینکه به نیازهای مشتریانتون توجه دارید متشکرم",
                "تلاش شما برای رضایت مشتری واقعاً قابل تحسینه",
                "سلام خدا قوت، بابت تمام کمک‌ها و راهنمایی‌هاتون ممنونم",
                "به خاطر اهتمام به جزئیات در محصول و خدمات‌تون، سپاس",
                "خریدی مطمئن و بی‌دردسر داشتم، متشکرم",
                "از زحمات و تعهد شما به کیفیت بسیار قدردانی می‌کنم",
                "تجربه خرید من با توجه به خدمات شما فوق‌العاده بود",
                "محصول بسیار زودتر از انتظارم رسید، ممنون از سرعت عمل شما",
                "ارتباط عالی و خدمات مشتری ممتازی دارید، سپاس گذارم",
                "از انعطاف‌پذیری شما در ارائه خدمات ممنونم",
                "کیفیت عالی، قیمت مناسب، خدمات برتر. متشکرم برای همه چیز",
                "محصول فوق‌العاده‌ای را ارائه دادید، واقعاً ممنونم",
                "با سلام، هر بار خرید از شما یک تجربه لذت‌بخشه، ممنونم.",
                "با سلام و احترام، بابت سهولت در فرآیند خرید آنلاین، متشکرم.",
                "توضیحات کامل و دقیق محصول، خرید را آسان کرد، خسته نباشید",
                "از اینکه همیشه پاسخگو هستید، قدردانی می‌کنم",
                "به خاطر ارائه محصولی فراتر از انتظارم، ممنونم",
                "خریدی راحت و مطمئن داشتم، به لطف شما. متشکرم",
                "بابت تلاشتون برای فراهم آوردن بهترین تجرب خرید آنلاین سپاس گذارم",
                "از خرید خود کاملاً راضی هستم، فروشگاه فوق‌العاده‌ای دارید",
                "سرویس و پاسخگویی شما واقعاًاستثناییه، متشکرم",
                "کیفیت محصولات و سرعت ارسالتون حیرت‌انگیزه. سپاس",
                "بسته‌بندی محصول بسیار حرفه‌ای بود، ممنون از دقتتون",
                "متشکرم که خرید آنلاین را اینقدر آسان و لذت‌بخش کرده‌اید",
                "هر بار که از شما خرید می‌کنم، تجربه‌ای بهتر از دفعه قبل دارم",
                "خدمات مشتری فوق‌العاده‌ای دارید، واقعاً قدردانی می‌کنم",
                "سلام وقت بخیر، محصولاتتون همیشه از کیفیت بالایی برخوردار هستند، متشکرم",
                "از تمام زحماتتون برای ارائه خدمات عالی، سپاسگزارم",
                "بهترین تجربه خرید آنلاین را با شما داشتم، سپاس فراوان",
                "فروشگاه شما واقعاً متمایزه، متشکرم برای همه چیز",
                "پشتیبانی شگفت‌انگیز و دوستانه‌ای دارید، ممنون از همراهیتون",
                "محصول با کیفیت، قیمت منصفانه، خدمات برجسته، متشکرم",
                "بابت سرعت ارسال و کیفیت بسته‌بندی، قدردانی می‌کنم",
                "از اینکه به نظرات و پیشنهادات مشتری اهمیت می‌دهید، سپاسگزارم",
                "سلام خدا قوت فروشگاه شما هر بار موزها را بالاتر می‌برد، متشکرم",
                "به خاطر محصولات عالی و قیمت‌های رقابتی، سپاس",
                "شما موز جدیدی برای خرید آنلاین تعیین کرده‌اید، ممنونم",
                "فروشگاه شما همیشه انتخاب اول منه، قدردان تلاش‌هایتون هستم",
                "بابت تلاشتون برای رسیدن به رضایت کامل مشتریان، سپاس",
                "با سلام و احترام، از پیگیری و دقت نظر شما در ارائه خدمات متشکرم",
                "هر خرید از شما تجربه‌ای خوشایند و رضایت‌بخشه",
                "محصولات و خدمات شما فراتر از انتظار بود، سپاس فراوان",
                "سرعت پاسخگویی و حرفه‌ای‌گری شما واقعاً قابل ستایشه",
                "مشتری دائمی شما شده‌ام، ممنونم برای تجربه عالی",
                "از دقت و توجه شما به جزئیات در هر خرید، قدردانی می‌کنم",
                "فروشگاهتون همیشه انتخاب اول من برای خرید آنلاینه، ممنون",
                "بابت همه چیز از شما سپاسگزارم، فروشگاهتون بی‌نظیره",
                "تجربه خرید از شما همیشه بی‌دردسر و لذت‌بخش بوده مرسی",
                "با سلام، قدردان تلاش‌های شما برای ارائه بهترین‌ها هستم، متشکرم",
                "شما موزهای خرید آنلاین را تغییر داده‌اید، مچکرم",
                "به خاطر پاسخگویی سریع و مفیدتون، واقعاً ممنونم",
                "فروشگاه شما همیشه از انتظارات من بالاتر می‌رود، خسته نباشید",
                "به خاطر ساختن فضایی امن و مطمئن برای خرید آنلاین، متشکرم",
                "با تشکر از فروشگاه اینترنتی شما برای خدمات عالی و ارسال سریع سفارشاتم",
                "خریدی فوق‌العاده از فروشگاهی فوق‌العاده! ممنونم از توجه و دقت شما",
                "واقعاً راضی‌ام، محصول بی‌نقص و خدمات عالی. دست مریزاد",
                "تجربه‌ای عالی از خرید، تا دفعه‌ی بعد. سپاسگزارم",
                "کیفیت محصول و سرعت ارسال، هر دو عالی بودند. مرسی از شما",
                "بسته‌بندی حرفه‌ای و ارسال سریع، تشکر از حرفه‌ای بودن شما",
                "توضیحات دقیق و صادقانه، از این بابت سپاسگزارم",
                "خدمات مشتری فوق‌العاده، احساس خوبی به من دادید. متشکرم",
                "خرید بی‌دردسر و لذت‌بخش، به لطف شما. ممنونم",
                "هر چیزی بهتر از چیزی که انتظار داشتم بود. شگفت‌انگیز",
                "بابت توجه به جزئیات و محصول باکیفیت، تشکر می‌کنم",
                "از خریدم کاملاً راضی‌ام، شما واقعی حرفه‌اید ",
                "تجربه‌ی فوق‌العاده‌ای بود، مطمئناً دوباره خرید می‌کنم",
                "سپاس برای ارائه‌ی خدماتی دوستانه و حرفه‌ای",
                "خریدی رضایت‌بخش با خدمات عالی، مرسی از همه چیز",
                "ممنون از اینکه خرید آنلاین را به تجربه‌ای دلپذیر تبدیل کردید",
                "با تشکر از سرعت و دقت شما در ارسال، کاملاً راضی‌ام",
                "خسته نباشید، از صداقت و حرفه‌ای‌گری شما بسیار قدردانی می‌کنم ",
                "خریدی بی‌نظیر، فروشنده‌ای بی‌نظیرتر! متشکرم بابت همه چیز",
                "بسته‌بندی عالی و ارسال سریع، تجربه‌ای عالی بود",
                "محصول عالی، خدمات بی‌نظیر، سپاس فراوان از شما",
                "از تعهد شما به کیفیت و رضایت مشتری بسیار قدردانی می‌کنم",
                "خریدی بدون دردسر و محصولی عالی، مرسی که هستید",
                "از اینکه خریدی آسان و لذت‌بخش را فراهم کردید، سپاسگزارم",
                "محصول و خدمت شما بی‌عیب و نقص بود، تشکر بابت همه چیز",
                "با سپاس از پیگیری و توجه شما، خریدی عالی داشتم",
                "مرسی که خرید آنلاین را به تجربه‌ای بی‌نظیر تبدیل کردید",
                "تجربه‌ی خریدی فراموش‌نشدنی، به لطف شما. سپاس فراوان",
                "سپاس برای ارائه محصولی عالی و خدماتی دوستانه",
                "با سلام محصولی عالی با قیمت مناسب، تشکر از شما ",
                "مرسی بابت تجربه‌ی خریدی سریع و راحت، واقعاً قدردانی می‌کنم",
                "فروشنده‌ای دقیق و متعهد، خریدی عالی. متشکرم",
                "تشکر از اینکه به سوالاتم با دقت پاسخ دادید، خدمات مشتری عالی",
                "بسته‌بندی دقیق و مراقبتی، ممنون از توجه شما",
                "از پشتیبانی شما در تمام مراحل خرید سپاسگزارم",
                "محصولی با کیفیت و ارسالی بی‌نقص، سپاس برای همه چیز",
                "تشکر برای تلاش‌هایتون در ارائه‌ی خدماتی بی‌عیب"

            ]

            # Shuffle the comment bodies to randomize their order
            random.shuffle(comment_bodies)

            user = None

            comments_created = 0

            # Define a start and end date range for random date generation
            start_date = timezone.make_aware(timezone.datetime(2022, 1, 1))  # Use make_aware to make datetime aware
            end_date = timezone.make_aware(timezone.datetime(2023, 12, 31))

            for product in products:
                existing_comments_count = ProductComment.objects.filter(product=product).count()
                if existing_comments_count >= 5:
                    self.stdout.write(self.style.WARNING(f'Product ID {product.id} already has 5 comments. Skipping.'))
                    continue

                for _ in range(5 - existing_comments_count):  # Create only the remaining required comments
                    if not comment_bodies:
                        self.stdout.write(self.style.WARNING('All comments used.'))
                        break

                    comment_body = comment_bodies.pop()
                    rating = random.randint(3, 5)  # Generate random rating between 3 and 5

                    # Generate a random datetime within the specified range
                    random_date = timezone.make_aware(timezone.datetime(
                        random.randint(2022, 2024),  # Random year between 2022 and 2023
                        random.randint(1, 12),  # Random month between 1 and 12
                        random.randint(1, 28),  # Random day between 1 and 28 (assuming 28 days in Feb)
                        random.randint(0, 23),  # Random hour between 0 and 23
                        random.randint(0, 59),  # Random minute between 0 and 59
                        random.randint(0, 59),  # Random second between 0 and 59
                    ))

                    comment = ProductComment.objects.create(
                        body=comment_body,
                        email="admin@example.com",  # Replace with actual email if needed
                        product=product,
                        created_by=user,
                        active=True,  # You can modify this as needed
                        rating=rating,  # Assign the random rating
                        created_at=random_date  # Assign the random created_at date
                    )

                    self.stdout.write(self.style.SUCCESS(
                        f'Successfully created comment: {comment} for Product ID {product.id} with rating {rating} and date {random_date}'
                    ))
                    comments_created += 1

        except Product.DoesNotExist:
            self.stderr.write(self.style.ERROR('Product does not exist with the provided ID'))
        except User.DoesNotExist:
            self.stderr.write(self.style.ERROR('User does not exist with the provided ID'))
